<template>
  <div id="app" >
      <span id="fatherSpan"  v-for="(question,index) in questions" v-bind:key="question">
        <span class="childSpan" >{{index+1}}. {{question}}</span>   <br>
        <Qustion  v-bind:answer="answers[index]" ></Qustion>
      </span>
    <span>
      <span class="childSpan" >28. {{special[0]}}</span>   <br>
      <Qustion   v-bind:answer="special[1]"  class="childSpan" ></Qustion>
      <br>
      <Qustion v-bind:answer="special[2]" class="childSpan"></Qustion>
    </span>
  </div>
</template>




<script>
import Qustion from "@/components/Question/Qustion";

export default {
  name: 'app',
  components: {
    Qustion
  },
  data() {
    return {
      questions: [
        ' 您的身份是？ ',
        ' 您在校外有没有给孩子报学习辅导班 ',
        ' 您给孩子报学习辅导班的主要目的是 ',
        ' 你是否感觉自己的孩子学习需要被强制监督 ',
        ' 您平时是否有监督孩子写作业的时间 ',
        ' 您是否觉得自己孩子会自觉学习？ ',
        ' 您是否有给自己孩子报网课的想法？ ',
        ' 您是否希望有一款智能机器来帮助您监督孩子学习 ',
        ' 如果有这么一款机器，您希望它有什么必须功能（多选） ',
        ' 对于这样一款机器，您的价格预期是多少 ',
        ' 如果有这么一款机器，您希望它有什么额外功能（多选） ',
        ' 您之前是否通过远程监控等工具监督孩子学习 ',
        ' 在远程监控等工具监督下孩子的学习效果较之前如何 ',
        ' 您之前是否给孩子购买过学习机等学习助手 ',
        ' 孩子使用学习机等学习助手的学习效果较之前如何 ',
        ' 您希望您的孩子在使用该产品时，如果检测到不良学习姿态学习助手应该做出什么反应？ ',
        ' 对于产品（一个桌面学习助手)的外观你偏向于哪种？ ',
        ' 你希望产品的logo的标志在产品的显眼位置吗？ ',
        ' 您是否在写作业的时候经常走神？ ',
        ' 您是否希望有一个设备监督你学习，在你有神的时候自动提醒你 ',
        ' 对于家长可以随时看到你的学习情况你的态度 ',
        ' 请问你的孩子在学习时能否保持较高效率 ',
        ' 如果有一款可以监督孩子学习的软件，您希望包括哪些方面？ ',
        ' 假如有一款可以监督孩子学习的软件，功能齐全且具有创新性，你会使用吗？ ',
        ' 您平时一周中能抽出多少时间照看孩子写作业 ',
        ' 您觉得孩子到了多大年纪不需要您的作业辅导 ',
        ' 您家里有能辅助孩子学习的智能设备吗，您觉得这些设备是否减轻了您的工作。 ',
      ],
      answers :[
        ['家长', '学生'] ,
        ['有', '无'] ,
        ['补习孩子课内知识', '提高孩子课外能力', '督促孩子完成作业'] ,
        ['是', '否', '无所谓'] ,
        ['有', '无', '有时间但是没有监督', '没时间但是想监督'] ,
        ['是', '否', '没关注过'] ,
        ['是', '否', '无所谓'] ,
        ['是', '否'] ,
        ['走神提醒', '反馈学习效率、专注度等情况', '迷你监控探头'] ,
        ['200及以下', '200-500', '500-800', '800-1000'] ,
        ['时钟', 'wifi通讯', '音乐播放器', '学习用具储放'] ,
        ['有', '无'] ,
        ['孩子学习效果明显提高', '孩子学习效果提高不大', '孩子学习效果变得更差'] ,
        ['有', '无'] ,
        ['孩子学习效果明显提高', '孩子学习效果提高不大', '孩子学习效果变得更差'] ,
        ['发出警报并上传不良姿态照片', '仅发送不良姿态照片', '仅发出警报'] ,
        ['卡通', '简约', '华丽'] ,
        ['是', '否'] ,
        ['是', '没有'] ,
        ['是', '否'] ,
        ['非常乐意，监督我使我进步', '无所谓，对我没有影响', '不情愿，不希望被时刻监督着'] ,
        ['能', '不能', '时而能，时而不能'] ,
        ['时间管理', '学习计划', '自我监控', '目标调整', '习惯养成', '情感陪伴'] ,
        ['会使用', '不会使用'] ,
        ['2小时以下', '2小时到6小时', '6小时以上'] ,
        ['六年级以上', '初中毕业', '其他'] ,
        ['是', '否，智能设备没有用'],

      ],
      special: ["你对你的孩子在线学习管理怎样",
                ['管理极少，不知道孩子是否在学习', '管理较少，完全靠孩子管理'],
                ['管理较多，时刻督促孩子学习', '管理极多，频繁查看孩子学习成果']
      ]
    }
  }
}



</script>

<style>
#app {
  font-family: 'Avenir', Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  margin-top: 60px;
}
.childSpan{
  margin-left: 40px;
  font-size: 15px;
  display: flex ;
  flex-direction: row
}
#fatherSpan{
  display: flex;
  flex-direction: column
}
</style>
